[
  {
    "id": "fc-1",
    "front": "Hình thái kinh tế – xã hội là gì?",
    "back": "Là một chỉnh thể xã hội ở mỗi giai đoạn lịch sử, gồm lực lượng sản xuất, quan hệ sản xuất và kiến trúc thượng tầng, phản ánh trình độ phát triển của xã hội loài người."
  },
  {
    "id": "fc-2",
    "front": "Có mấy hình thái kinh tế – xã hội cơ bản trong lịch sử?",
    "back": "5 hình thái: Cộng sản nguyên thủy, Chiếm hữu nô lệ, Phong kiến, Tư bản chủ nghĩa, Cộng sản chủ nghĩa (giai đoạn đầu là XHCN)."
  },
  {
    "id": "fc-3",
    "front": "Động lực làm xã hội chuyển từ hình thái này sang hình thái khác là gì?",
    "back": "Sự phát triển của lực lượng sản xuất làm mâu thuẫn với quan hệ sản xuất cũ, dẫn tới cách mạng xã hội và hình thái mới ra đời."
  },
  {
    "id": "fc-4",
    "front": "Đặc trưng của hình thái phong kiến?",
    "back": "Sở hữu ruộng đất thuộc địa chủ, nông dân lệ thuộc bị bóc lột địa tô, quan hệ sản xuất dựa trên tô thuế và lao dịch."
  },
  {
    "id": "fc-5",
    "front": "Đặc trưng của hình thái tư bản chủ nghĩa?",
    "back": "Tư hữu tư liệu sản xuất, giai cấp tư sản và vô sản, bóc lột thông qua giá trị thặng dư, lao động làm thuê."
  },
  {
    "id": "fc-6",
    "front": "Giá trị thặng dư là gì?",
    "back": "Là phần giá trị do công nhân tạo ra lớn hơn tiền lương họ nhận được, bị nhà tư bản chiếm đoạt."
  },
  {
    "id": "fc-7",
    "front": "Đặc điểm của hình thái cộng sản chủ nghĩa?",
    "back": "Công hữu tư liệu sản xuất, không còn bóc lột giai cấp, phân phối theo lao động (giai đoạn đầu), hướng tới công bằng, tự do, phát triển toàn diện con người."
  },
  {
    "id": "fc-8",
    "front": "Quá độ lên CNXH ở Việt Nam là gì?",
    "back": "Là quá trình chuyển từ xã hội tiền tư bản lên CNXH, bỏ qua chế độ tư bản chủ nghĩa, thông qua phát triển lực lượng sản xuất và hoàn thiện quan hệ sản xuất XHCN."
  },
  {
    "id": "fc-9",
    "front": "Giai cấp là gì?",
    "back": "Là những tập đoàn người khác nhau về: Quan hệ với tư liệu sản xuất, Vai trò trong sản xuất, Cách hưởng thụ của cải xã hội."
  },
  {
    "id": "fc-10",
    "front": "Đấu tranh giai cấp là gì?",
    "back": "Là cuộc đấu tranh giữa các giai cấp có lợi ích đối lập nhằm bảo vệ hoặc giành quyền lợi kinh tế, chính trị và xã hội."
  },
  {
    "id": "fc-11",
    "front": "Giới tăng lữ, tu hành có phải là giai cấp không?",
    "back": "Không. Họ là tầng lớp xã hội, vì không gắn với một quan hệ sản xuất riêng biệt và không có lợi ích kinh tế giai cấp độc lập."
  },
  {
    "id": "fc-12",
    "front": "Vai trò của giới tăng lữ trong xã hội hiện nay?",
    "back": "Định hướng đạo đức, tinh thần; Bảo tồn văn hóa; Làm từ thiện, an sinh xã hội; Góp phần ổn định xã hội."
  },
  {
    "id": "fc-13",
    "front": "Vì sao các hình thái kinh tế – xã hội thay thế nhau là tất yếu?",
    "back": "Vì đó là quy luật khách quan, không phụ thuộc ý muốn chủ quan, do mâu thuẫn giữa lực lượng sản xuất và quan hệ sản xuất."
  },
  {
    "id": "fc-14",
    "front": "\"Bỏ qua\" một hình thái kinh tế – xã hội nghĩa là gì?",
    "back": "Là không trải qua đầy đủ một hình thái, mà tiếp thu thành tựu của nó để phát triển rút ngắn (ví dụ: Việt Nam bỏ qua TBCN để lên CNXH)."
  },
  {
    "id": "fc-15",
    "front": "Cơ sở hạ tầng và kiến trúc thượng tầng là gì?",
    "back": "Cơ sở hạ tầng: Toàn bộ quan hệ sản xuất của xã hội. Kiến trúc thượng tầng: Nhà nước, pháp luật, tôn giáo, đạo đức, tư tưởng…"
  }
]
