[
  {
    "id": "htktxh-overview",
    "slug": "hinh-thai-kinh-te-xa-hoi",
    "title": "Hình thái kinh tế – xã hội",
    "status": "Chưa học",
    "sections": [
      {
        "heading": "Định nghĩa hình thái kinh tế – xã hội",
        "body": "Trong học thuyết Mác – Lênin, hình thái kinh tế – xã hội là một chỉnh thể xã hội cụ thể trong lịch sử, bao gồm:\n\n• Lực lượng sản xuất,\n• Quan hệ sản xuất,\n• Kiến trúc thượng tầng (nhà nước, pháp luật, tư tưởng, chính trị, đạo đức…),\n\nđược hình thành và vận động trong những điều kiện lịch sử nhất định.\n\nMỗi hình thái kinh tế – xã hội phản ánh một trình độ phát triển nhất định của xã hội loài người, trong đó các giai cấp giữ vị trí và vai trò khác nhau tùy theo quan hệ của họ đối với tư liệu sản xuất.",
        "highlight": true
      },
      {
        "heading": "Ví dụ minh họa về hình thái kinh tế – xã hội",
        "body": "Hãy tưởng tượng một ngôi làng cổ trong xã hội phong kiến:\n\n• Nhóm A: Có ruộng đất, trâu bò, kho lúa → địa chủ\n• Nhóm B: Không có đất, phải đi cày thuê → nông dân lĩnh canh\n\nSau mùa vụ:\n• Nhóm A thu 8 phần lúa\n• Nhóm B chỉ được 2 phần lúa\n\n➡️ Đây là biểu hiện điển hình của hình thái kinh tế – xã hội phong kiến, trong đó:\n• Ruộng đất thuộc về địa chủ\n• Quan hệ sản xuất mang tính bóc lột\n• Xã hội phân hóa thành các giai cấp đối kháng",
        "hasImage": true,
        "image": "/Hình minh họa chủ đất – nông dân thời phong kiến.jpg",
        "imageCaption": "Hình minh họa chủ đất – nông dân thời phong kiến"
      },
      {
        "heading": "Đặc trưng của một hình thái kinh tế – xã hội",
        "body": "Một hình thái kinh tế – xã hội được nhận diện thông qua:",
        "bullets": [
          "Trình độ phát triển của lực lượng sản xuất",
          "Kiểu quan hệ sản xuất giữ vai trò thống trị",
          "Sự phân chia giai cấp và địa vị kinh tế – xã hội khác nhau",
          "Cách thức tổ chức lao động và phân phối sản phẩm",
          "Hệ thống chính trị – pháp luật – tư tưởng tương ứng"
        ]
      },
      {
        "heading": "Ví dụ minh họa trong hình thái kinh tế – xã hội tư bản chủ nghĩa",
        "body": "Trong một nhà máy hiện đại:\n\n• Chủ nhà máy → sở hữu máy móc, vốn (tư liệu sản xuất)\n• Quản đốc / quản lý → tổ chức, điều hành lao động\n• Công nhân → trực tiếp sản xuất ra sản phẩm\n\n➡️ Mỗi người có vai trò khác nhau trong quan hệ sản xuất, và thu nhập khác nhau, phản ánh sự phân tầng giai cấp đặc trưng của hình thái kinh tế – xã hội tư bản chủ nghĩa.",
        "hasImage": true,
        "image": "/Hình mô tả cấu trúc chủ – quản lý – công nhân.webp",
        "imageCaption": "Hình mô tả cấu trúc chủ – quản lý – công nhân"
      },
      {
        "heading": "Thực chất của quan hệ trong hình thái kinh tế – xã hội có đối kháng giai cấp",
        "body": "Trong các hình thái kinh tế – xã hội dựa trên chế độ tư hữu, quan hệ cơ bản là: **Quan hệ bóc lột và bị bóc lột**",
        "variant": "alert-red"
      },
      {
        "heading": "Ví dụ minh họa đơn giản",
        "body": "Một công nhân tạo ra 100 sản phẩm/ngày, trị giá 1.000.000 đồng:\n\n• Công nhân chỉ nhận 200.000 đồng tiền lương\n• 800.000 đồng còn lại thuộc về chủ sở hữu tư liệu sản xuất\n\n➡️ Khoản 800.000 đồng đó chính là giá trị thặng dư, biểu hiện bản chất bóc lột trong hình thái kinh tế – xã hội tư bản chủ nghĩa.",
        "hasImage": true,
        "image": "/gia-tri-thang-du.webp",
        "imageCaption": "Đồ họa cơ bản về giá trị thặng dư"
      },
      {
        "heading": "Ý nghĩa của học thuyết hình thái kinh tế – xã hội",
        "bullets": [
          "Khẳng định sự phát triển của xã hội loài người là một quá trình lịch sử – tự nhiên",
          "Chỉ ra rằng mỗi hình thái KT-XH đều có điểm khởi đầu, phát triển và bị thay thế",
          "Giúp giai cấp công nhân và nhân dân lao động nhận thức đúng bản chất xã hội",
          "Xác định vai trò lịch sử của mình trong đấu tranh cải tạo xã hội cũ",
          "Xây dựng hình thái kinh tế – xã hội tiến bộ hơn"
        ]
      },
      {
        "heading": "Ví dụ lịch sử",
        "body": "Cuối thế kỷ XIX – đầu XX, nhờ nhận thức rõ bản chất của hình thái kinh tế – xã hội tư bản chủ nghĩa, công nhân thế giới đã:\n\n• Thành lập công đoàn\n• Tổ chức đình công\n• Đấu tranh đòi giảm giờ làm, tăng lương, cải thiện điều kiện lao động\n\n➡️ Đây là hệ quả trực tiếp của việc nhận thức khoa học về hình thái kinh tế – xã hội.",
        "hasImage": true,
        "image": "/giai cấp công nhân đấu tranh.jpg",
        "imageCaption": "Hình công nhân đấu tranh lịch sử"
      }
    ]
  },
  {
    "id": "htktxh-structure",
    "slug": "cau-truc-hinh-thai-kinh-te-xa-hoi",
    "title": "Cấu trúc của Hình thái kinh tế – xã hội",
    "status": "Chưa học",
    "sections": [
      {
        "heading": "1. Lực lượng sản xuất",
        "body": "(Nền tảng vật chất – kỹ thuật của xã hội)\n\nLực lượng sản xuất là sự kết hợp giữa con người và tư liệu sản xuất trong quá trình sản xuất vật chất, thể hiện mối quan hệ giữa con người với tự nhiên.",
        "highlight": true
      },
      {
        "heading": "Các yếu tố của lực lượng sản xuất",
        "bullets": [
          "Người lao động: chủ thể sáng tạo, bao gồm thể chất, trí tuệ, kỹ năng và kinh nghiệm",
          "Tư liệu lao động: công cụ lao động (thước đo trình độ chinh phục tự nhiên), phương tiện lao động",
          "Đối tượng lao động: những bộ phận của tự nhiên được đưa vào sản xuất",
          "Khoa học – công nghệ: ngày nay trở thành lực lượng sản xuất trực tiếp, giữ vai trò then chốt"
        ]
      },
      {
        "heading": "2. Quan hệ sản xuất",
        "body": "(Bộ khung kinh tế – cơ sở hạ tầng của xã hội)\n\nQuan hệ sản xuất là các quan hệ kinh tế giữa người với người trong quá trình sản xuất vật chất. Tổng thể các quan hệ sản xuất hợp thành cơ sở hạ tầng của xã hội.",
        "highlight": true
      },
      {
        "heading": "Ba mặt của quan hệ sản xuất",
        "bullets": [
          "Quan hệ sở hữu đối với tư liệu sản xuất: quan hệ cơ bản, xuất phát, quyết định các quan hệ khác",
          "Quan hệ tổ chức, quản lý sản xuất: phân công lao động, điều hành sản xuất",
          "Quan hệ phân phối sản phẩm: cách thức phân chia của cải xã hội"
        ]
      },
      {
        "heading": "Lưu ý quan trọng",
        "body": "Chế độ tư hữu là nguyên nhân sâu xa dẫn đến sự hình thành giai cấp, nhưng giai cấp không phải là yếu tố cấu thành trực tiếp của cấu trúc hình thái kinh tế – xã hội.",
        "variant": "alert-red",
        "hasImage": true,
        "image": "/quan-he-san-xuat.jpg",
        "imageCaption": "Hình ảnh minh họa quan hệ sản xuất"
      },
      {
        "heading": "3. Kiến trúc thượng tầng",
        "body": "(Bộ khung chính trị – xã hội)\n\nKiến trúc thượng tầng là toàn bộ hệ thống tư tưởng và các thiết chế xã hội được hình thành trên một cơ sở hạ tầng kinh tế nhất định, nhằm bảo vệ và củng cố cơ sở đó.",
        "highlight": true
      },
      {
        "heading": "Các bộ phận của kiến trúc thượng tầng",
        "body": "Hệ thống tư tưởng: chính trị, pháp quyền, triết học, đạo đức, tôn giáo, nghệ thuật…",
        "bullets": [
          "Nhà nước (quan trọng nhất)",
          "Đảng phái chính trị",
          "Giáo hội",
          "Các tổ chức chính trị – xã hội khác"
        ]
      },
      {
        "heading": "Mối quan hệ giữa KTTT và CSHT",
        "body": "Kiến trúc thượng tầng tác động trở lại cơ sở hạ tầng, nhưng không quyết định cơ sở kinh tế. Cơ sở hạ tầng quyết định kiến trúc thượng tầng.",
        "variant": "alert-red"
      }
    ]
  },
  {
    "id": "htktxh-history",
    "slug": "cac-hinh-thai-kinh-te-xa-hoi-trong-lich-su",
    "title": "Các hình thái kinh tế – xã hội trong lịch sử",
    "status": "Chưa học",
    "sections": [
      {
        "heading": "I. Tiến trình phát triển tự nhiên",
        "body": "Lịch sử xã hội loài người không phải là sự lắp ghép ngẫu nhiên các chế độ xã hội, mà là một quá trình lịch sử – tự nhiên. Sự vận động này bắt nguồn từ sự phát triển của lực lượng sản xuất, làm thay đổi quan hệ sản xuất, dẫn đến sự thay thế tuần tự các hình thái từ thấp đến cao.",
        "highlight": true,
        "hasImage": true,
        "image": "/lich-su-phat-trien-xa-hoi.jpg",
        "imageCaption": "Quá trình tiến hóa của xã hội loài người"
      },
      {
        "heading": "5 hình thái kinh tế – xã hội cơ bản",
        "body": "Theo logic lịch sử, nhân loại trải qua 5 hình thái:",
        "bullets": [
          "1. Cộng sản nguyên thủy (CSNT)",
          "2. Chiếm hữu nô lệ (CHNL)",
          "3. Phong kiến",
          "4. Tư bản chủ nghĩa (TBCN)",
          "5. Cộng sản chủ nghĩa (Giai đoạn đầu: XHCN)"
        ]
      },
      {
        "heading": "II. Đặc trưng và Ví dụ minh họa",
        "body": "Mỗi hình thái ra đời khi hình thái cũ không còn phù hợp với trình độ phát triển của lực lượng sản xuất.",
        "highlight": true,
        "hasImage": true,
        "image": "/so-sanh-hinh-thai.jpg",
        "imageCaption": "So sánh đặc trưng các hình thái kinh tế - xã hội"
      },
      {
        "heading": "1. Hình thái Phong kiến (Ví dụ so sánh)",
        "body": "**Đặc trưng:** Quan hệ sản xuất dựa trên sở hữu ruộng đất của địa chủ và sự lệ thuộc của nông dân. Hình thức bóc lột chủ yếu là địa tô.\n\n**Ví dụ ngôi làng cổ:**\n\n🔹 **Nhóm A (Địa chủ):** Sở hữu ruộng đất, trâu bò, kho lúa.\n🔹 **Nhóm B (Nông dân):** Không có đất, phải đi cày thuê.\n\n➡️ **Kết quả:** Sau mùa vụ, Nhóm A thu 8 phần lúa, Nhóm B chỉ hưởng 2 phần.",
        "hasImage": true,
        "image": "/xa-hoi-phong-kien-la-gi-su-hinh-thanh-phat-trien-cua-xa-hoi-phong-kien-1.jpg",
        "imageCaption": "Biểu hiện của quan hệ bóc lột địa tô trong xã hội phong kiến"
      },
      {
        "heading": "2. Hình thái Tư bản chủ nghĩa (Ví dụ so sánh)",
        "body": "**Đặc trưng:** Dựa trên chế độ chiếm hữu tư nhân TBCN. Xã hội phân hóa thành Tư sản và Vô sản. Hình thức bóc lột là giá trị thặng dư.\n\n**Ví dụ nhà máy hiện đại:**\n\n🔹 **Chủ nhà máy:** Sở hữu máy móc, vốn.\n🔹 **Công nhân:** Trực tiếp sản xuất, không sở hữu máy móc.\n\n➡️ **Giá trị thặng dư:** Công nhân tạo ra 1.000.000đ/ngày nhưng chỉ nhận lương 200.000đ. Khoản chênh lệch 800.000đ thuộc về ông chủ.",
        "hasImage": true,
        "image": "/nguoi_lao_dong_bi_boc_lot_0507155506.png",
        "imageCaption": "Bản chất bóc lột giá trị thặng dư trong TBCN"
      },
      {
        "heading": "3. Hình thái Cộng sản chủ nghĩa",
        "body": "Là tất yếu khách quan. Hướng tới xóa bỏ áp bức, bóc lột; xây dựng chế độ công hữu về tư liệu sản xuất.\n\n• Giai đoạn đầu (XHCN): Làm theo năng lực, hưởng theo lao động.\n• Giai đoạn cao: Làm theo năng lực, hưởng theo nhu cầu.",
        "highlight": true,
        "hasImage": true,
        "image": "/xa-hoi-chu-nghia.jpg",
        "imageCaption": "Xã hội chủ nghĩa - giai đoạn đầu của Cộng sản chủ nghĩa"
      },
      {
        "heading": "III. Tính quy luật của sự phát triển",
        "body": "Các hình thái thay thế nhau do quy luật khách quan: Lực lượng sản xuất phát triển → Quan hệ sản xuất cũ kìm hãm → Mâu thuẫn gay gắt → Cách mạng xã hội nổ ra.",
        "variant": "alert-red",
        "hasImage": true,
        "image": "/quy-luat-phat-trien.jpg",
        "imageCaption": "Quy luật thay thế các hình thái kinh tế - xã hội"
      },
      {
        "heading": "Tính đặc thù – Sự phát triển 'bỏ qua'",
        "body": "Do điều kiện lịch sử và bối cảnh quốc tế, một số quốc gia có thể rút ngắn con đường phát triển.\n\n📌 **Ví dụ:** Việt Nam bỏ qua chế độ Tư bản chủ nghĩa để đi lên Chủ nghĩa xã hội.",
        "hasImage": true,
        "image": "/lyluanchinhtri.vn-home-media-k2-items-cache-_e91f5df61683ad642f80f8746e777635_l.jpg",
        "imageCaption": "Việt Nam quá độ lên Chủ nghĩa xã hội"
      },
      {
        "heading": "IV. Ghi nhớ nhanh",
        "bullets": [
          "Trình tự: CSNT → CHNL → Phong kiến → TBCN → CSCN",
          "Động lực phát triển: Lực lượng sản xuất",
          "Bản chất thay thế: Do mâu thuẫn giữa LLSX và QHSX",
          "Trọng tâm: Phong kiến (bóc lột địa tô) vs TBCN (bóc lột giá trị thặng dư)"
        ]
      }
    ]
  },
  {
    "id": "htktxh-law",
    "slug": "quy-luat-van-dong-thay-the",
    "title": "Quy luật vận động và thay thế các hình thái KT-XH",
    "status": "Chưa học",
    "sections": [
      {
        "heading": "I. Cơ sở của quy luật vận động xã hội",
        "body": "Sự phát triển của xã hội tuân theo quy luật khách quan quan trọng nhất: **Quy luật quan hệ sản xuất phải phù hợp với trình độ phát triển của lực lượng sản xuất.**\n\nHình thái kinh tế - xã hội gồm 3 bộ phận: LLSX (nền tảng), QHSX (cơ sở hạ tầng), và Kiến trúc thượng tầng.",
        "highlight": true
      },
      {
        "heading": "Vai trò của Lực lượng sản xuất",
        "body": "LLSX là yếu tố **năng động nhất**, luôn phát triển không ngừng. Khi LLSX phát triển đến trình độ mới, nó đòi hỏi QHSX phải thay đổi cho phù hợp."
      },
      {
        "heading": "Vai trò của Quan hệ sản xuất",
        "body": "QHSX là 'hình thức xã hội' của sản xuất. Nếu phù hợp với LLSX thì **thúc đẩy** phát triển; nếu lỗi thời thì **kìm hãm**, dẫn đến mâu thuẫn."
      },
      {
        "heading": "Vai trò của Kiến trúc thượng tầng",
        "body": "KTTT được xác định bởi QHSX, có tác động ngược lại **bảo vệ hoặc phá vỡ** QHSX cũ. Nhà nước là công cụ quan trọng nhất trong việc duy trì hoặc thay đổi hình thái."
      },
      {
        "heading": "II. Mâu thuẫn – Nguồn gốc sự thay thế"
      },
      {
        "body": "Khi LLSX phát triển nhưng QHSX cũ vẫn giữ nguyên → Mâu thuẫn gay gắt → Khủng hoảng → Cách mạng xã hội → Hình thái mới ra đời.",
        "variant": "alert-red",
        "hasImage": true,
        "image": "/mau-thuan-llsx-qhsx.jpg",
        "imageCaption": "Mô hình mâu thuẫn giữa LLSX và QHSX"
      },
      {
        "heading": "Ví dụ minh họa tiêu biểu",
        "bullets": [
          "Từ Phong kiến → Tư bản: LLSX (máy móc) mâu thuẫn với QHSX phong kiến (nông nô) → Cách mạng tư sản.",
          "Trong lòng CNTB: LLSX (xã hội hóa cao) mâu thuẫn với QHSX (chiếm hữu tư nhân) → Tiền đề cho CNXH."
        ]
      },
      {
        "heading": "III. Quy luật thay thế các hình thái",
        "body": "Mỗi hình thái chỉ tồn tại trong một giai đoạn nhất định. Trình tự phổ biến: CSNT → CHNL → Phong kiến → TBCN → CSCN.",
        "highlight": true
      },
      {
        "heading": "IV. Tính khách quan và Lịch sử – Cụ thể",
        "bullets": [
          "Tính khách quan: Không phụ thuộc vào ý muốn chủ quan, con người chỉ có thể nhận thức và vận dụng.",
          "Tính lịch sử – cụ thể: Mỗi quốc gia có con đường riêng (Có nước đi tuần tự, có nước 'bỏ qua')."
        ]
      },
      {
        "heading": "V. Con đường phát triển đặc thù của từng quốc gia",
        "body": "Các quốc gia không nhất thiết phải trải qua **tuần tự đầy đủ** tất cả 5 hình thái. Trong điều kiện lịch sử cụ thể, một quốc gia có thể **rút ngắn** hoặc **vượt qua** một số giai đoạn.\n\n📌 **Ví dụ Việt Nam:** Từ xã hội phong kiến trực tiếp lên CNXH (không trải qua TBCN phát triển đầy đủ), nhờ bối cảnh thời đại mới và sự lãnh đạo của Đảng Cộng sản.",
        "hasImage": true,
        "image": "/ly-luan-ve-thoi-ky-qua-do-len-chu-nghia-xa-hoi-o-viet-nam-tu-di-san-vo-gia-cua-chu-tich-ho-chi-minh-den-ly-luan-sau-sac-cua-tong-bi-thu-nguyen-phu-trong_2.jpg",
        "imageCaption": "Con đường quá độ lên CNXH ở Việt Nam"
      },
      {
        "heading": "VI. Ghi nhớ nhanh",
        "bullets": [
          "Động lực sâu xa: Mâu thuẫn giữa LLSX và QHSX",
          "Nguyên nhân thay thế: QHSX cũ kìm hãm LLSX",
          "Hình thức thay thế: Cách mạng xã hội",
          "Tính chất quy luật: Khách quan – lịch sử – cụ thể",
          "Con đường Việt Nam: Bỏ qua TBCN, đi lên CNXH"
        ]
      }
    ]
  },
  {
    "id": "htktxh-capitalism",
    "slug": "hinh-thai-tu-ban-chu-nghia",
    "title": "Hình thái kinh tế – xã hội tư bản chủ nghĩa",
    "status": "Chưa học",
    "sections": [
      {
        "heading": "I. Khái niệm",
        "body": "Là giai đoạn phát triển lịch sử trong đó quan hệ sản xuất tư bản chủ nghĩa giữ vai trò thống trị. Đặc trưng bởi sở hữu tư nhân về tư liệu sản xuất và lao động làm thuê nhằm mục đích tối đa hóa lợi nhuận.",
        "highlight": true
      },
      {
        "heading": "II. Cơ sở kinh tế của TBCN",
        "bullets": [
          "Chế độ sở hữu tư nhân tư bản chủ nghĩa: Tư liệu sản xuất thuộc về thiểu số nhà tư bản.",
          "Lao động làm thuê: Người lao động không có tư liệu sản xuất, phải bán sức lao động.",
          "Sản xuất vì lợi nhuận: Mục đích tối cao là lợi nhuận, thông qua bóc lột giá trị thặng dư."
        ],
        "hasImage": true,
        "image": "/Screenshot 2026-01-22 163952.png",
        "imageCaption": "Sơ đồ cơ sở kinh tế của CNTB"
      },
      {
        "heading": "III. Cấu trúc giai cấp",
        "body": "Xã hội phân hóa sâu sắc thành hai giai cấp cơ bản đối kháng:",
        "bullets": [
          "Giai cấp Tư sản: Sở hữu tư liệu sản xuất, nắm quyền chi phối, chiếm đoạt giá trị thặng dư.",
          "Giai cấp Vô sản: Không sở hữu tư liệu sản xuất, bán sức lao động, bị bóc lột.",
          "Tầng lớp trung gian: Tiểu tư sản, trí thức, quản lý... (ngày càng đa dạng)."
        ]
      },
      {
        "heading": "IV. Bản chất bóc lột: Giá trị thặng dư",
        "body": "**Giá trị thặng dư** là phần giá trị dôi ra ngoài tiền lương do công nhân tạo ra nhưng bị nhà tư bản chiếm đoạt.\n\n📌 **Ví dụ:** Công nhân làm ra 1.000.000đ, chỉ được trả 200.000đ → 800.000đ là giá trị thặng dư.",
        "variant": "alert-red",
        "hasImage": true,
        "image": "/gia-tri-thang-du-minh-hoa.jpg",
        "imageCaption": "Minh họa bản chất bóc lột giá trị thặng dư"
      },
      {
        "heading": "V. Đặc điểm nổi bật của TBCN",
        "bullets": [
          "Phát triển lực lượng sản xuất mạnh mẽ: Tạo ra năng suất lao động cao chưa từng có.",
          "Mâu thuẫn nội tại sâu sắc: Giữa tính xã hội hóa của sản xuất và chế độ chiếm hữu tư nhân.",
          "Sự tha hóa con người: Quan hệ người – người bị vật hóa thành quan hệ tiền tệ."
        ]
      },
      {
        "heading": "VI. Xu hướng phát triển của TBCN hiện đại",
        "body": "TBCN liên tục điều chỉnh để tồn tại nhưng bản chất bóc lột không thay đổi:",
        "bullets": [
          "Can thiệp nhà nước và phúc lợi xã hội để xoa dịu mâu thuẫn.",
          "Toàn cầu hóa tư bản: Chuyển dịch sản xuất, bóc lột lao động giá rẻ.",
          "Kinh tế số và tư bản công nghệ: Hình thức bóc lột tinh vi hơn qua dữ liệu và nền tảng."
        ]
      },
      {
        "heading": "VII. Ý nghĩa nhận thức và thực tiễn",
        "body": "TBCN là một nấc thang lịch sử nhưng không phải là cuối cùng. Việc Việt Nam phát triển kinh tế thị trường định hướng XHCN là sự vận dụng sáng tạo, tiếp thu mặt tích cực của nhân loại nhưng không đi theo con đường TBCN.",
        "highlight": true
      },
      {
        "heading": "VIII. Ghi nhớ nhanh",
        "bullets": [
          "Cơ sở kinh tế: Sở hữu tư nhân TBCN",
          "Quan hệ cơ bản: Tư sản – Vô sản",
          "Bản chất bóc lột: Giá trị thặng dư",
          "Động lực phát triển: Lợi nhuận",
          "Mâu thuẫn cơ bản: Xã hội hóa ↔ Tư hữu",
          "Xu hướng: Bị thay thế bởi CNXH"
        ]
      }
    ]
  },
  {
    "id": "htktxh-communism",
    "slug": "hinh-thai-cong-san-chu-nghia",
    "title": "Hình thái kinh tế – xã hội Cộng sản chủ nghĩa (CSCN)",
    "status": "Chưa học",
    "sections": [
      {
        "heading": "I. Khái niệm",
        "body": "CSCN là hình thái phát triển cao nhất, đặc trưng bởi: chế độ công hữu về TLSX, xóa bỏ áp bức bóc lột, con người được giải phóng toàn diện. Trải qua 2 giai đoạn: Xã hội chủ nghĩa (thấp) và Cộng sản chủ nghĩa (cao).",
        "highlight": true
      },
      {
        "heading": "II. Sự ra đời – Tính tất yếu lịch sử",
        "bullets": [
          "Nguyên nhân kinh tế: Mâu thuẫn giữa tính xã hội hóa cao của sản xuất và chế độ chiếm hữu tư nhân TBCN → đòi hỏi QHSX mới.",
          "Nguyên nhân chính trị: Giai cấp vô sản lớn mạnh, đấu tranh dưới sự lãnh đạo của Đảng Cộng sản."
        ]
      },
      {
        "heading": "III. Hai giai đoạn phát triển",
        "body": "Phân biệt 2 giai đoạn phân phối:",
        "bullets": [
          "Giai đoạn thấp (XHCN): 'Làm theo năng lực, hưởng theo lao động'.",
          "Giai đoạn cao (CSCN hoàn chỉnh): 'Làm theo năng lực, hưởng theo nhu cầu'."
        ]
      },
      {
        "heading": "Ví dụ minh họa hai giai đoạn",
        "bullets": [
          "XHCN (Hợp tác xã): Ai làm nhiều hưởng nhiều, chưa bình đẳng tuyệt đối.",
          "CSCN (Xã hội tương lai): Của cải dồi dào, ai cần gì lấy nấy, quan hệ nhân văn."
        ]
      },
      {
        "heading": "IV. Cơ sở kinh tế và Đặc trưng xã hội"
      },
      {
        "bullets": [
          "Cơ sở kinh tế: Công hữu về TLSX, sản xuất vì con người, lao động tự nguyện sáng tạo.",
          "Đặc trưng xã hội: Xóa bỏ áp bức, công bằng, phát triển con người toàn diện."
        ],
        "variant": "alert-red",
        "hasImage": true,
        "image": "/xa-hoi-tuong-lai.jpg",
        "imageCaption": "Mô hình xã hội hướng tới sự phát triển toàn diện"
      },
      {
        "heading": "VI. Nhà nước trong CSCN",
        "body": "• **Giai đoạn XHCN:** Nhà nước còn tồn tại để tổ chức quản lý và trấn áp phản cách mạng.\n• **Giai đoạn CSCN:** Nhà nước tự tiêu vong, thay bằng sự quản lý cộng đồng tự giác.",
        "highlight": true
      },
      {
        "heading": "VII. Ý nghĩa nhận thức và thực tiễn",
        "bullets": [
          "Hiểu mục tiêu cuối cùng của nhân loại: Giải phóng con người.",
          "Tại Việt Nam: Kiên định con đường đi lên CNXH, hiểu đúng thời kỳ quá độ."
        ]
      },
      {
        "heading": "VIII. Ghi nhớ nhanh",
        "bullets": [
          "Hình thái cao nhất: CSCN (2 giai đoạn: XHCN → CSCN hoàn chỉnh)",
          "Cơ sở kinh tế: Công hữu TLSX",
          "Mục đích sản xuất: Vì con người",
          "Phân phối: XHCN (Theo lao động) → CSCN (Theo nhu cầu)",
          "Nhà nước: XHCN (Tồn tại) → CSCN (Tiêu vong)"
        ]
      }
    ]
  },
  {
    "id": "htktxh-vietnam",
    "slug": "qua-do-len-cnxh-viet-nam",
    "title": "Quá độ lên chủ nghĩa xã hội ở Việt Nam",
    "status": "Chưa học",
    "sections": [
      {
        "heading": "I. Khái niệm quá độ lên CNXH",
        "body": "Quá độ lên Chủ nghĩa xã hội (XHCN) là giai đoạn chuyển tiếp lịch sử từ xã hội tư bản chủ nghĩa (TBCN) hoặc phong kiến sang xã hội xã hội chủ nghĩa, và hướng tới Cộng sản chủ nghĩa hoàn chỉnh.",
        "highlight": true
      },
      {
        "heading": "Đặc trưng của quá độ",
        "bullets": [
          "Vừa phải kế thừa thành tựu của các hình thái trước",
          "Vừa phải xóa bỏ áp bức, bóc lột giai cấp",
          "Không thể đạt ngay CSCN, phải đi từng bước thực tiễn"
        ]
      },
      {
        "heading": "II. Cơ sở khách quan của quá độ",
        "body": "Việt Nam có điều kiện đặc thù để quá độ lên CNXH:"
      },
      {
        "heading": "Về lực lượng sản xuất",
        "bullets": [
          "Nông nghiệp còn chiếm tỷ trọng cao",
          "Công nghiệp mới hình thành, năng suất lao động còn thấp",
          "Cần thời gian để phát triển lực lượng sản xuất"
        ]
      },
      {
        "heading": "Về mâu thuẫn nội tại",
        "bullets": [
          "Giai cấp phong kiến – tư sản còn tồn tại",
          "Giai cấp vô sản chưa đủ mạnh về số lượng, kinh tế, chính trị",
          "Cần xây dựng chế độ XHCN để giải quyết mâu thuẫn"
        ]
      },
      {
        "heading": "Ảnh hưởng quốc tế",
        "bullets": [
          "Cách mạng Tháng Mười Nga (1917)",
          "Chiến tranh giải phóng dân tộc",
          "Hợp tác quốc tế với các nước xã hội chủ nghĩa"
        ]
      },
      {
        "heading": "III. Nguyên tắc quá độ lên CNXH"
      },
      {
        "heading": "1. Lấy giai cấp công nhân làm nòng cốt",
        "bullets": [
          "Công nhân là lực lượng lãnh đạo cách mạng xã hội",
          "Có vai trò quyết định trong xây dựng quan hệ sản xuất mới"
        ]
      },
      {
        "heading": "2. Liên minh công – nông – trí thức",
        "body": "Hợp tác giữa giai cấp công nhân, nông dân và trí thức. Đảm bảo sự ổn định và bền vững của quá trình quá độ."
      },
      {
        "heading": "3. Xây dựng nền kinh tế nhiều thành phần",
        "bullets": [
          "Kinh tế Nhà nước: là động lực chủ yếu",
          "Kinh tế tập thể: hợp tác xã, tổ hợp sản xuất",
          "Kinh tế tư nhân: được khuyến khích, nhưng phục vụ XHCN",
          "Nguyên tắc: phát triển lực lượng sản xuất + công bằng xã hội"
        ]
      },
      {
        "heading": "4. Phát triển lực lượng sản xuất",
        "bullets": [
          "Tăng năng suất lao động",
          "Áp dụng khoa học – công nghệ",
          "Giảm đói nghèo, nâng cao giáo dục, y tế",
          "Tạo cơ sở vật chất – xã hội cho CNXH"
        ]
      },
      {
        "heading": "IV. Hình thức và phương thức thực hiện"
      },
      {
        "heading": "Cách mạng chính trị – xã hội",
        "bullets": [
          "Lật đổ chế độ phong kiến, xóa bỏ áp bức",
          "Xây dựng chính quyền XHCN"
        ]
      },
      {
        "heading": "Cải cách kinh tế – ruộng đất",
        "bullets": [
          "Chuyển giao tài sản, tư liệu sản xuất cho nhân dân",
          "Hợp tác hóa nông nghiệp, phát triển công nghiệp"
        ]
      },
      {
        "heading": "Xây dựng nền văn hóa XHCN",
        "bullets": [
          "Xây dựng con người mới",
          "Đào tạo trí thức, kỹ sư, cán bộ quản lý",
          "Giáo dục tinh thần công bằng, đoàn kết, sáng tạo"
        ]
      },
      {
        "heading": "V. Thời kỳ quá độ ở Việt Nam"
      },
      {
        "heading": "Giai đoạn 1945 – 1954",
        "body": "Khởi đầu quá độ: Xây dựng chính quyền cách mạng, cải cách ruộng đất, tổ chức các hợp tác xã nông nghiệp, công nghiệp nhẹ."
      },
      {
        "heading": "Giai đoạn 1954 – 1975 (miền Bắc)",
        "bullets": [
          "Hợp tác hóa nông nghiệp",
          "Xây dựng công nghiệp cơ bản",
          "Giáo dục, y tế, văn hóa: nâng cao dân trí"
        ]
      },
      {
        "heading": "Giai đoạn sau 1975 – nay (toàn quốc)",
        "bullets": [
          "Đổi mới (1986): áp dụng kinh tế thị trường định hướng XHCN",
          "Vừa phát triển kinh tế, vừa giữ định hướng XHCN",
          "Nâng cao đời sống vật chất, tinh thần",
          "Tiếp thu thành tựu khoa học – kỹ thuật thế giới"
        ]
      },
      {
        "heading": "VI. Mục tiêu và ý nghĩa của quá độ"
      },
      {
        "heading": "Về kinh tế",
        "bullets": [
          "Phát triển lực lượng sản xuất",
          "Xóa đói giảm nghèo",
          "Đảm bảo kinh tế bền vững"
        ]
      },
      {
        "heading": "Về chính trị",
        "bullets": [
          "Giai cấp công nhân lãnh đạo",
          "Liên minh công – nông – trí thức ổn định xã hội"
        ]
      },
      {
        "heading": "Về xã hội",
        "bullets": [
          "Xóa bỏ áp bức, bất công",
          "Xây dựng con người mới",
          "Tăng cường đoàn kết, hợp tác xã hội"
        ]
      },
      {
        "heading": "Thành tựu đạt được",
        "bullets": [
          "GDP tăng từ 14 tỷ USD (1985) → hơn 430 tỷ USD (2023)",
          "Thoát khỏi danh sách nước nghèo, trở thành nước thu nhập trung bình",
          "93% dân số có bảo hiểm y tế",
          "Hội nhập quốc tế sâu rộng (WTO, FTA...)"
        ]
      },
      {
        "heading": "Kết luận",
        "body": "Việt Nam kiên định con đường đi lên CNXH là phù hợp với quy luật phát triển của lịch sử và nguyện vọng của nhân dân.",
        "variant": "alert-red"
      }
    ]
  }
]