[
  {
    "id": "htktxh-overview",
    "slug": "hinh-thai-kinh-te-xa-hoi",
    "title": "Hình thái kinh tế – xã hội",
    "status": "Chưa học",
    "sections": [
      {
        "heading": "Định nghĩa hình thái kinh tế – xã hội",
        "body": "Trong học thuyết Mác – Lênin, hình thái kinh tế – xã hội là một chỉnh thể xã hội cụ thể trong lịch sử, bao gồm:\n\n• Lực lượng sản xuất,\n• Quan hệ sản xuất,\n• Kiến trúc thượng tầng (nhà nước, pháp luật, tư tưởng, chính trị, đạo đức…),\n\nđược hình thành và vận động trong những điều kiện lịch sử nhất định.\n\nMỗi hình thái kinh tế – xã hội phản ánh một trình độ phát triển nhất định của xã hội loài người, trong đó các giai cấp giữ vị trí và vai trò khác nhau tùy theo quan hệ của họ đối với tư liệu sản xuất.",
        "highlight": true
      },
      {
        "heading": "Ví dụ minh họa về hình thái kinh tế – xã hội",
        "body": "Hãy tưởng tượng một ngôi làng cổ trong xã hội phong kiến:\n\n• Nhóm A: Có ruộng đất, trâu bò, kho lúa → địa chủ\n• Nhóm B: Không có đất, phải đi cày thuê → nông dân lĩnh canh\n\nSau mùa vụ:\n• Nhóm A thu 8 phần lúa\n• Nhóm B chỉ được 2 phần lúa\n\n➡️ Đây là biểu hiện điển hình của hình thái kinh tế – xã hội phong kiến, trong đó:\n• Ruộng đất thuộc về địa chủ\n• Quan hệ sản xuất mang tính bóc lột\n• Xã hội phân hóa thành các giai cấp đối kháng",
        "hasImage": true,
        "image": "/Hình minh họa chủ đất – nông dân thời phong kiến.jpg",
        "imageCaption": "Hình minh họa chủ đất – nông dân thời phong kiến"
      },
      {
        "heading": "Đặc trưng của một hình thái kinh tế – xã hội",
        "body": "Một hình thái kinh tế – xã hội được nhận diện thông qua:",
        "bullets": [
          "Trình độ phát triển của lực lượng sản xuất",
          "Kiểu quan hệ sản xuất giữ vai trò thống trị",
          "Sự phân chia giai cấp và địa vị kinh tế – xã hội khác nhau",
          "Cách thức tổ chức lao động và phân phối sản phẩm",
          "Hệ thống chính trị – pháp luật – tư tưởng tương ứng"
        ]
      },
      {
        "heading": "Ví dụ minh họa trong hình thái kinh tế – xã hội tư bản chủ nghĩa",
        "body": "Trong một nhà máy hiện đại:\n\n• Chủ nhà máy → sở hữu máy móc, vốn (tư liệu sản xuất)\n• Quản đốc / quản lý → tổ chức, điều hành lao động\n• Công nhân → trực tiếp sản xuất ra sản phẩm\n\n➡️ Mỗi người có vai trò khác nhau trong quan hệ sản xuất, và thu nhập khác nhau, phản ánh sự phân tầng giai cấp đặc trưng của hình thái kinh tế – xã hội tư bản chủ nghĩa.",
        "hasImage": true,
        "image": "/Hình mô tả cấu trúc chủ – quản lý – công nhân.webp",
        "imageCaption": "Hình mô tả cấu trúc chủ – quản lý – công nhân"
      },
      {
        "heading": "Thực chất của quan hệ trong hình thái kinh tế – xã hội có đối kháng giai cấp",
        "body": "Trong các hình thái kinh tế – xã hội dựa trên chế độ tư hữu, quan hệ cơ bản là: **Quan hệ bóc lột và bị bóc lột**",
        "variant": "alert-red"
      },
      {
        "heading": "Ví dụ minh họa đơn giản",
        "body": "Một công nhân tạo ra 100 sản phẩm/ngày, trị giá 1.000.000 đồng:\n\n• Công nhân chỉ nhận 200.000 đồng tiền lương\n• 800.000 đồng còn lại thuộc về chủ sở hữu tư liệu sản xuất\n\n➡️ Khoản 800.000 đồng đó chính là giá trị thặng dư, biểu hiện bản chất bóc lột trong hình thái kinh tế – xã hội tư bản chủ nghĩa.",
        "hasImage": true,
        "image": "/gia-tri-thang-du.webp",
        "imageCaption": "Đồ họa cơ bản về giá trị thặng dư"
      },
      {
        "heading": "Ý nghĩa của học thuyết hình thái kinh tế – xã hội",
        "bullets": [
          "Khẳng định sự phát triển của xã hội loài người là một quá trình lịch sử – tự nhiên",
          "Chỉ ra rằng mỗi hình thái KT-XH đều có điểm khởi đầu, phát triển và bị thay thế",
          "Giúp giai cấp công nhân và nhân dân lao động nhận thức đúng bản chất xã hội",
          "Xác định vai trò lịch sử của mình trong đấu tranh cải tạo xã hội cũ",
          "Xây dựng hình thái kinh tế – xã hội tiến bộ hơn"
        ]
      },
      {
        "heading": "Ví dụ lịch sử",
        "body": "Cuối thế kỷ XIX – đầu XX, nhờ nhận thức rõ bản chất của hình thái kinh tế – xã hội tư bản chủ nghĩa, công nhân thế giới đã:\n\n• Thành lập công đoàn\n• Tổ chức đình công\n• Đấu tranh đòi giảm giờ làm, tăng lương, cải thiện điều kiện lao động\n\n➡️ Đây là hệ quả trực tiếp của việc nhận thức khoa học về hình thái kinh tế – xã hội.",
        "hasImage": true,
        "image": "/giai cấp công nhân đấu tranh.jpg",
        "imageCaption": "Hình công nhân đấu tranh lịch sử"
      }
    ]
  },
  {
    "id": "htktxh-structure",
    "slug": "cau-truc-hinh-thai-kinh-te-xa-hoi",
    "title": "Cấu trúc của Hình thái kinh tế – xã hội",
    "status": "Chưa học",
    "sections": [
      {
        "heading": "1. Lực lượng sản xuất",
        "body": "(Nền tảng vật chất – kỹ thuật của xã hội)\n\nLực lượng sản xuất là sự kết hợp giữa con người và tư liệu sản xuất trong quá trình sản xuất vật chất, thể hiện mối quan hệ giữa con người với tự nhiên.",
        "highlight": true
      },
      {
        "heading": "Các yếu tố của lực lượng sản xuất",
        "bullets": [
          "Người lao động: chủ thể sáng tạo, bao gồm thể chất, trí tuệ, kỹ năng và kinh nghiệm",
          "Tư liệu lao động: công cụ lao động (thước đo trình độ chinh phục tự nhiên), phương tiện lao động",
          "Đối tượng lao động: những bộ phận của tự nhiên được đưa vào sản xuất",
          "Khoa học – công nghệ: ngày nay trở thành lực lượng sản xuất trực tiếp, giữ vai trò then chốt"
        ],
        "hasImage": true,
        "image": "/luc-luong-san-xuat.jpg",
        "imageCaption": "Hình ảnh minh họa lực lượng sản xuất"
      },
      {
        "heading": "2. Quan hệ sản xuất",
        "body": "(Bộ khung kinh tế – cơ sở hạ tầng của xã hội)\n\nQuan hệ sản xuất là các quan hệ kinh tế giữa người với người trong quá trình sản xuất vật chất. Tổng thể các quan hệ sản xuất hợp thành cơ sở hạ tầng của xã hội.",
        "highlight": true
      },
      {
        "heading": "Ba mặt của quan hệ sản xuất",
        "bullets": [
          "Quan hệ sở hữu đối với tư liệu sản xuất: quan hệ cơ bản, xuất phát, quyết định các quan hệ khác",
          "Quan hệ tổ chức, quản lý sản xuất: phân công lao động, điều hành sản xuất",
          "Quan hệ phân phối sản phẩm: cách thức phân chia của cải xã hội"
        ]
      },
      {
        "heading": "Lưu ý quan trọng",
        "body": "Chế độ tư hữu là nguyên nhân sâu xa dẫn đến sự hình thành giai cấp, nhưng giai cấp không phải là yếu tố cấu thành trực tiếp của cấu trúc hình thái kinh tế – xã hội.",
        "variant": "alert-red",
        "hasImage": true,
        "image": "/quan-he-san-xuat.jpg",
        "imageCaption": "Hình ảnh minh họa quan hệ sản xuất"
      },
      {
        "heading": "3. Kiến trúc thượng tầng",
        "body": "(Bộ khung chính trị – xã hội)\n\nKiến trúc thượng tầng là toàn bộ hệ thống tư tưởng và các thiết chế xã hội được hình thành trên một cơ sở hạ tầng kinh tế nhất định, nhằm bảo vệ và củng cố cơ sở đó.",
        "highlight": true
      },
      {
        "heading": "Các bộ phận của kiến trúc thượng tầng",
        "body": "Hệ thống tư tưởng: chính trị, pháp quyền, triết học, đạo đức, tôn giáo, nghệ thuật…",
        "bullets": [
          "Nhà nước (quan trọng nhất)",
          "Đảng phái chính trị",
          "Giáo hội",
          "Các tổ chức chính trị – xã hội khác"
        ]
      },
      {
        "heading": "Mối quan hệ giữa KTTT và CSHT",
        "body": "Kiến trúc thượng tầng tác động trở lại cơ sở hạ tầng, nhưng không quyết định cơ sở kinh tế. Cơ sở hạ tầng quyết định kiến trúc thượng tầng.",
        "variant": "alert-red"
      }
    ]
  },
  {
    "id": "htktxh-history",
    "slug": "cac-hinh-thai-kinh-te-xa-hoi-trong-lich-su",
    "title": "Các hình thái kinh tế - xã hội trong lịch sử",
    "status": "Chưa học",
    "sections": [
      {
        "heading": "5 hình thái KT-XH trong lịch sử",
        "body": "Theo C.Mác, lịch sử loài người đã và sẽ trải qua 5 hình thái kinh tế - xã hội kế tiếp nhau.",
        "highlight": true
      },
      {
        "heading": "1. Cộng sản nguyên thủy",
        "body": "Khoảng 2,5 triệu năm - 4000 TCN",
        "bullets": [
          "Công cụ lao động thô sơ (đá, gỗ, xương)",
          "Sở hữu chung về tư liệu sản xuất",
          "Lao động tập thể, phân phối bình đẳng",
          "Chưa có giai cấp và nhà nước"
        ]
      },
      {
        "heading": "2. Chiếm hữu nô lệ",
        "body": "Khoảng 4000 TCN - thế kỷ V",
        "bullets": [
          "Xuất hiện chế độ tư hữu về tư liệu sản xuất",
          "Chủ nô sở hữu cả nô lệ như tài sản",
          "Mâu thuẫn chủ nô - nô lệ",
          "Nhà nước đầu tiên ra đời"
        ]
      },
      {
        "heading": "3. Phong kiến",
        "body": "Thế kỷ V - thế kỷ XVIII",
        "bullets": [
          "Địa chủ sở hữu ruộng đất",
          "Nông dân phụ thuộc vào ruộng đất",
          "Quan hệ bóc lột địa tô",
          "Nhà nước quân chủ chuyên chế"
        ]
      },
      {
        "heading": "4. Tư bản chủ nghĩa",
        "body": "Thế kỷ XVIII - nay",
        "bullets": [
          "Tư sản sở hữu tư liệu sản xuất",
          "Công nhân bán sức lao động",
          "Bóc lột giá trị thặng dư",
          "Dân chủ tư sản, nhà nước pháp quyền"
        ]
      },
      {
        "heading": "5. Cộng sản chủ nghĩa",
        "body": "Tương lai (giai đoạn đầu là XHCN)",
        "bullets": [
          "Sở hữu công cộng về tư liệu sản xuất",
          "Xóa bỏ giai cấp và bóc lột",
          "Phân phối theo lao động (XHCN) → theo nhu cầu (CSCN)",
          "Nhà nước tiêu vong dần"
        ]
      }
    ]
  },
  {
    "id": "htktxh-law",
    "slug": "quy-luat-van-dong-thay-the",
    "title": "Quy luật vận động và thay thế các hình thái KT-XH",
    "status": "Chưa học",
    "sections": [
      {
        "heading": "Quy luật cơ bản",
        "body": "Quy luật quan hệ sản xuất phù hợp với trình độ phát triển của lực lượng sản xuất là quy luật cơ bản chi phối sự vận động, phát triển và thay thế các hình thái kinh tế - xã hội.",
        "highlight": true
      },
      {
        "heading": "Tính khách quan của sự thay thế",
        "body": "Sự thay thế các hình thái KT-XH là quá trình lịch sử - tự nhiên, không phụ thuộc vào ý muốn chủ quan của con người.",
        "bullets": [
          "Do mâu thuẫn giữa lực lượng sản xuất và quan hệ sản xuất",
          "Mâu thuẫn giữa cơ sở hạ tầng và kiến trúc thượng tầng",
          "Cách mạng xã hội là động lực thay đổi"
        ]
      },
      {
        "heading": "Nguyên nhân sâu xa",
        "body": "Mâu thuẫn cơ bản của xã hội là mâu thuẫn giữa lực lượng sản xuất (phát triển) và quan hệ sản xuất (lỗi thời). Khi mâu thuẫn gay gắt → cách mạng xã hội → hình thái KT-XH mới ra đời.",
        "variant": "alert-red"
      },
      {
        "heading": "Tính thống nhất và đa dạng",
        "body": "Các dân tộc đều tuân theo quy luật chung nhưng có thể có con đường phát triển riêng.",
        "bullets": [
          "Xu hướng chung: tiến lên chủ nghĩa xã hội",
          "Có thể 'bỏ qua' một số giai đoạn phát triển",
          "Phụ thuộc vào điều kiện cụ thể của mỗi nước"
        ]
      }
    ]
  },
  {
    "id": "htktxh-capitalism",
    "slug": "hinh-thai-tu-ban-chu-nghia",
    "title": "Hình thái kinh tế - xã hội tư bản chủ nghĩa",
    "status": "Chưa học",
    "sections": [
      {
        "heading": "Sự ra đời của CNTB",
        "body": "Chủ nghĩa tư bản ra đời từ sự tan rã của chế độ phong kiến (thế kỷ XVI-XVIII), thông qua quá trình tích lũy tư bản nguyên thủy.",
        "highlight": true
      },
      {
        "heading": "Đặc trưng của CNTB",
        "bullets": [
          "Sở hữu tư nhân về tư liệu sản xuất",
          "Sản xuất hàng hóa phát triển cao",
          "Bóc lột giá trị thặng dư là bản chất",
          "Mâu thuẫn cơ bản: giữa tính xã hội của sản xuất và hình thức chiếm hữu tư nhân TBCN"
        ]
      },
      {
        "heading": "Giá trị thặng dư",
        "body": "Là phần giá trị do lao động công nhân tạo ra vượt quá giá trị sức lao động, bị nhà tư bản chiếm đoạt. Đây là bản chất của bóc lột tư bản.",
        "variant": "alert-red"
      },
      {
        "heading": "Vai trò lịch sử của CNTB",
        "bullets": [
          "Phát triển lực lượng sản xuất mạnh mẽ chưa từng có",
          "Xã hội hóa sản xuất ở trình độ cao",
          "Tạo tiền đề vật chất - kỹ thuật cho CNXH",
          "Đào tạo, rèn luyện giai cấp công nhân - chủ thể của cách mạng XHCN"
        ]
      },
      {
        "heading": "Những hạn chế và mâu thuẫn",
        "bullets": [
          "Bất bình đẳng xã hội ngày càng sâu sắc",
          "Khủng hoảng kinh tế chu kỳ",
          "Thất nghiệp, phân hóa giàu nghèo",
          "Tàn phá môi trường, cạn kiệt tài nguyên"
        ]
      }
    ]
  },
  {
    "id": "htktxh-communism",
    "slug": "hinh-thai-cong-san-chu-nghia",
    "title": "Hình thái kinh tế - xã hội cộng sản chủ nghĩa",
    "status": "Chưa học",
    "sections": [
      {
        "heading": "Tính tất yếu của CNCS",
        "body": "Hình thái kinh tế - xã hội cộng sản chủ nghĩa thay thế hình thái tư bản chủ nghĩa là tất yếu lịch sử, do mâu thuẫn cơ bản của CNTB quy định.",
        "highlight": true
      },
      {
        "heading": "Hai giai đoạn phát triển",
        "body": "CNCS phát triển qua hai giai đoạn: Chủ nghĩa xã hội (giai đoạn thấp) và Chủ nghĩa cộng sản (giai đoạn cao).",
        "bullets": [
          "XHCN: 'Làm theo năng lực, hưởng theo lao động'",
          "CSCN: 'Làm theo năng lực, hưởng theo nhu cầu'"
        ]
      },
      {
        "heading": "Đặc trưng của CNXH",
        "bullets": [
          "Lực lượng sản xuất phát triển cao dựa trên KHCN hiện đại",
          "Chế độ công hữu về tư liệu sản xuất chủ yếu",
          "Xóa bỏ bóc lột giai cấp",
          "Nhà nước XHCN do nhân dân lao động làm chủ",
          "Nền văn hóa tiên tiến, đậm đà bản sắc dân tộc"
        ]
      },
      {
        "heading": "Đặc trưng của CNCS (giai đoạn cao)",
        "bullets": [
          "Lực lượng sản xuất phát triển cực cao",
          "Sở hữu toàn dân về tư liệu sản xuất",
          "Xóa bỏ hoàn toàn giai cấp",
          "Nhà nước tiêu vong",
          "Con người phát triển toàn diện"
        ]
      }
    ]
  },
  {
    "id": "htktxh-vietnam",
    "slug": "qua-do-len-cnxh-viet-nam",
    "title": "Quá độ lên chủ nghĩa xã hội ở Việt Nam",
    "status": "Chưa học",
    "sections": [
      {
        "heading": "Con đường đi lên CNXH ở Việt Nam",
        "body": "Việt Nam lựa chọn con đường quá độ lên CNXH bỏ qua chế độ TBCN, từ một nước nông nghiệp lạc hậu. Đây là sự lựa chọn phù hợp với quy luật lịch sử và điều kiện cụ thể của đất nước.",
        "highlight": true
      },
      {
        "heading": "Đặc điểm thời kỳ quá độ ở Việt Nam",
        "bullets": [
          "Quá độ lên CNXH bỏ qua giai đoạn TBCN",
          "Từ một nước nông nghiệp lạc hậu, bị chiến tranh tàn phá",
          "Trong bối cảnh toàn cầu hóa và cách mạng KHCN",
          "Dưới sự lãnh đạo của Đảng Cộng sản Việt Nam"
        ]
      },
      {
        "heading": "Mục tiêu tổng quát",
        "body": "Dân giàu, nước mạnh, dân chủ, công bằng, văn minh.",
        "variant": "alert-red"
      },
      {
        "heading": "Nhiệm vụ trong thời kỳ quá độ",
        "bullets": [
          "Công nghiệp hóa, hiện đại hóa đất nước",
          "Phát triển kinh tế thị trường định hướng XHCN",
          "Xây dựng Nhà nước pháp quyền XHCN",
          "Xây dựng nền văn hóa tiên tiến, đậm đà bản sắc dân tộc",
          "Bảo vệ vững chắc Tổ quốc XHCN"
        ]
      },
      {
        "heading": "Thành tựu đạt được",
        "bullets": [
          "GDP tăng từ 14 tỷ USD (1985) → hơn 430 tỷ USD (2023)",
          "Thoát khỏi danh sách nước nghèo, trở thành nước thu nhập trung bình",
          "93% dân số có bảo hiểm y tế",
          "Hội nhập quốc tế sâu rộng (WTO, FTA...)"
        ]
      },
      {
        "heading": "Kết luận",
        "body": "Việt Nam kiên định con đường đi lên CNXH là phù hợp với quy luật phát triển của lịch sử và nguyện vọng của nhân dân.",
        "variant": "alert-red"
      }
    ]
  }
]